nxp-mcuxpresso/mcux-soc-svd/MIMXRT1042/MIMXRT1042.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC_GPR</name>
      <description>IOMUXC_GPR</description>
      <groupName>IOMUXC_GPR</groupName>
      <prependToName>IOMUXC_GPR_</prependToName>
      <baseAddress>0x400AC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPR0</name>
          <description>GPR0 General Purpose Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR1</name>
          <description>GPR1 General Purpose Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAI1_MCLK1_SEL</name>
              <description>SAI1 MCLK1 source select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_0</name>
                  <description>ccm.ssi1_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_1</name>
                  <description>ccm.ssi2_clk_root</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_2</name>
                  <description>ccm.ssi3_clk_root</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_3</name>
                  <description>iomux.sai1_ipg_clk_sai_mclk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_4</name>
                  <description>iomux.sai2_ipg_clk_sai_mclk</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_5</name>
                  <description>iomux.sai3_ipg_clk_sai_mclk</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK2_SEL</name>
              <description>SAI1 MCLK2 source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_0</name>
                  <description>ccm.ssi1_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_1</name>
                  <description>ccm.ssi2_clk_root</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_2</name>
                  <description>ccm.ssi3_clk_root</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_3</name>
                  <description>iomux.sai1_ipg_clk_sai_mclk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_4</name>
                  <description>iomux.sai2_ipg_clk_sai_mclk</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_5</name>
                  <description>iomux.sai3_ipg_clk_sai_mclk</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK3_SEL</name>
              <description>SAI1 MCLK3 source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_0</name>
                  <description>ccm.spdif0_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_1</name>
                  <description>iomux.spdif_tx_clk2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_2</name>
                  <description>spdif.spdif_srclk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_3</name>
                  <description>spdif.spdif_outclock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI2_MCLK3_SEL</name>
              <description>SAI2 MCLK3 source select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI2_MCLK3_SEL_0</name>
                  <description>ccm.spdif0_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI2_MCLK3_SEL_1</name>
                  <description>iomux.spdif_tx_clk2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI2_MCLK3_SEL_2</name>
                  <description>spdif.spdif_srclk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI2_MCLK3_SEL_3</name>
                  <description>spdif.spdif_outclock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_MCLK3_SEL</name>
              <description>SAI3 MCLK3 source select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_0</name>
                  <description>ccm.spdif0_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_1</name>
                  <description>iomux.spdif_tx_clk2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_2</name>
                  <description>spdif.spdif_srclk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_3</name>
                  <description>spdif.spdif_outclock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GINT</name>
              <description>Global Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GINT_0</name>
                  <description>Global interrupt request is not asserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GINT_1</name>
                  <description>Global interrupt request is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET1_CLK_SEL</name>
              <description>ENET1 reference clock mode select.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET1_CLK_SEL_0</name>
                  <description>ENET1 TX reference clock driven by ref_enetpll. This clock is also output to pins via the IOMUX. ENET_REF_CLK1 function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET1_CLK_SEL_1</name>
                  <description>Gets ENET1 TX reference clock from the ENET1_TX_CLK pin. In this use case, an external OSC provides the clock for both the external PHY and the internal controller.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET2_CLK_SEL</name>
              <description>ENET2 reference clock mode select.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET2_CLK_SEL_0</name>
                  <description>ENET2 TX reference clock driven by ref_enetpll. This clock is also output to pins via the IOMUX. ENET2_REF_CLK function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET2_CLK_SEL_1</name>
                  <description>Gets ENET2 TX reference clock from the ENET2_TX_CLK pin. In this use case, an external OSC provides the clock for both the external PHY and the internal controller.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET1_TX_CLK_DIR</name>
              <description>ENET1_TX_CLK data direction control</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET1_TX_CLK_DIR_0</name>
                  <description>ENET1_TX_CLK output driver is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET1_TX_CLK_DIR_1</name>
                  <description>ENET1_TX_CLK output driver is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET2_TX_CLK_DIR</name>
              <description>ENET2_TX_CLK data direction control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET2_TX_CLK_DIR_0</name>
                  <description>ENET2_TX_CLK output driver is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET2_TX_CLK_DIR_1</name>
                  <description>ENET2_TX_CLK output driver is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK_DIR</name>
              <description>sai1.MCLK signal direction control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK_DIR_0</name>
                  <description>sai1.MCLK is input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK_DIR_1</name>
                  <description>sai1.MCLK is output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI2_MCLK_DIR</name>
              <description>sai2.MCLK signal direction control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI2_MCLK_DIR_0</name>
                  <description>sai2.MCLK is input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI2_MCLK_DIR_1</name>
                  <description>sai2.MCLK is output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_MCLK_DIR</name>
              <description>sai3.MCLK signal direction control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_MCLK_DIR_0</name>
                  <description>sai3.MCLK is input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK_DIR_1</name>
                  <description>sai3.MCLK is output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXC_MON</name>
              <description>Exclusive monitor response select of illegal command</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXC_MON_0</name>
                  <description>OKAY response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXC_MON_1</name>
                  <description>SLVError response (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET_IPG_CLK_S_EN</name>
              <description>ENET ipg_clk_s clock gating enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET_IPG_CLK_S_EN_0</name>
                  <description>ipg_clk_s is gated when there is no IPS access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET_IPG_CLK_S_EN_1</name>
                  <description>ipg_clk_s is always on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_FORCE_HCLK_EN</name>
              <description>Arm CM7 platform AHB clock enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_FORCE_HCLK_EN_0</name>
                  <description>AHB clock is not running (gated) when CM7 is sleeping and TCM is not accessible.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_FORCE_HCLK_EN_1</name>
                  <description>AHB clock is running (enabled) when CM7 is sleeping and TCM is accessible.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
