nxp-mcuxpresso/mcux-soc-svd/MIMXRT1042/MIMXRT1042.xml
        <register>
          <name>HP0</name>
          <description>HP0 register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HP_DMA</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the eDMA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_DMA_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_DMA_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DMA</name>
              <description>Lock bit set by the TZ software for the eDMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DMA_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DMA_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_LCDIF</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the LCDIF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_LCDIF_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_LCDIF_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_LCDIF</name>
              <description>Lock bit set by the TZ software for the LCDIF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_LCDIF_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_LCDIF_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_CSI</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the CSI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_CSI_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_CSI_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_CSI</name>
              <description>Lock bit set by the TZ software for the CSI</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_CSI_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_CSI_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_PXP</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the PXP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_PXP_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_PXP_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_PXP</name>
              <description>Lock bit set by the TZ software for the PXP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_PXP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_PXP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_DCP</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the DCP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_DCP_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_DCP_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DCP</name>
              <description>Lock bit set by the TZ software for the DCP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DCP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DCP_1</name>
                  <description>Lock-the adjacent (next lower) bit cannot be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_ENET</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the ENET</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_ENET_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_ENET_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENET</name>
              <description>Lock bit set by the TZ software for the ENET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_ENET_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_ENET_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_USDHC1</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the USDHC1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_USDHC1_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_USDHC1_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC1</name>
              <description>Lock bit set by the TZ software for the USDHC1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC1_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC1_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_USDHC2</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the USDHC2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_USDHC2_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_USDHC2_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC2</name>
              <description>Lock bit set by the TZ software for the USDHC2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC2_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC2_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_TPSMP</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the TPSMP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_TPSMP_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_TPSMP_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_TPSMP</name>
              <description>Lock bit set by the TZ software for the TPSMP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_TPSMP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_TPSMP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_USB</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the USB</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_USB_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_USB_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USB</name>
              <description>Lock bit set by the TZ software for the USB</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USB_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USB_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_ENET2</name>
              <description>Determines whether the register value of the corresponding HP field is passed as the hprot[1] of the ENET2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP_ENET2_0</name>
                  <description>The hprot1 input signal value is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_ENET2_1</name>
                  <description>The HP register bit is routed to the csu_hprot1 output for the corresponding master.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENET2</name>
              <description>Lock bit set by the TZ software for the ENET2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_ENET2_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_ENET2_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
