nxp-mcuxpresso/mcux-soc-svd/MIMXRT1042/MIMXRT1042.xml
        <register>
          <name>SA</name>
          <description>Secure access register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSA_DMA</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_DMA_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_DMA_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DMA</name>
              <description>Lock bit set by the TZ software for the eDMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DMA_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DMA_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_LCDIF</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_LCDIF_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_LCDIF_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_LCDIF</name>
              <description>Lock bit set by the TZ software for the LCDIF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_LCDIF_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_LCDIF_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_CSI</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_CSI_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_CSI_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_CSI</name>
              <description>Lock bit set by the TZ software for the CSI</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_CSI_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_CSI_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_PXP</name>
              <description>Non-Secure Access Policy indicator bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_PXP_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_PXP_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_PXP</name>
              <description>Lock bit set by the TZ software for the PXP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_PXP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_PXP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_DCP</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_DCP_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_DCP_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DCP</name>
              <description>Lock bit set by the TZ software for the DCP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DCP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DCP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_ENET</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_ENET_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_ENET_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENET</name>
              <description>Lock bit set by the TZ software for the ENET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_ENET_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_ENET_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_USDHC1</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_USDHC1_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_USDHC1_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC1</name>
              <description>Lock bit set by the TZ software for the USDHC1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC1_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC1_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_USDHC2</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_USDHC2_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_USDHC2_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC2</name>
              <description>Lock bit set by the TZ software for the USDHC2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC2_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC2_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_TPSMP</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_TPSMP_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_TPSMP_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_TPSMP</name>
              <description>Lock bit set by the TZ software for the TPSMP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_TPSMP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_TPSMP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_USB</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_USB_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_USB_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USB</name>
              <description>Lock bit set by the TZ software for the USB</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USB_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USB_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSA_ENET2</name>
              <description>Non-secure access policy indicator bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSA_ENET2_0</name>
                  <description>Secure access for the corresponding type-1 master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSA_ENET2_1</name>
                  <description>Non-secure access for the corresponding type-1 master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENET2</name>
              <description>Lock bit set by the TZ software for the ENET2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_ENET2_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_ENET2_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
