nxp-mcuxpresso/mcux-soc-svd/MIMXRT1042/MIMXRT1042.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SRC</name>
      <description>SRC</description>
      <groupName>SRC</groupName>
      <prependToName>SRC_</prependToName>
      <baseAddress>0x400F8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x48</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SRC</name>
        <value>98</value>
      </interrupt>
      <registers>
        <register>
          <name>SCR</name>
          <description>SRC Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0480520</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask_wdog_rst</name>
              <description>Mask wdog_rst_b source</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mask_wdog_rst_5</name>
                  <description>wdog_rst_b is masked</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mask_wdog_rst_10</name>
                  <description>wdog_rst_b is not masked (default)</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>core0_rst</name>
              <description>Software reset for core0 only</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>core0_rst_0</name>
                  <description>do not assert core0 reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>core0_rst_1</name>
                  <description>assert core0 reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>core0_dbg_rst</name>
              <description>Software reset for core0 debug only</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>core0_dbg_rst_0</name>
                  <description>do not assert core0 debug reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>core0_dbg_rst_1</name>
                  <description>assert core0 debug reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>dbg_rst_msk_pg</name>
              <description>Do not assert debug resets after power gating event of core</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dbg_rst_msk_pg_0</name>
                  <description>do not mask core debug resets (debug resets will be asserted after power gating event)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dbg_rst_msk_pg_1</name>
                  <description>mask core debug resets (debug resets won't be asserted after power gating event)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mask_wdog3_rst</name>
              <description>Mask wdog3_rst_b source</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mask_wdog3_rst_5</name>
                  <description>wdog3_rst_b is masked</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mask_wdog3_rst_10</name>
                  <description>wdog3_rst_b is not masked</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBMR1</name>
          <description>SRC Boot Mode Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_CFG1</name>
              <description>Refer to fusemap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG2</name>
              <description>Refer to fusemap.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG3</name>
              <description>Refer to fusemap.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG4</name>
              <description>Refer to fusemap.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSR</name>
          <description>SRC Reset Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ipp_reset_b</name>
              <description>Indicates whether reset was the result of ipp_reset_b pin (Power-up sequence)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ipp_reset_b_0</name>
                  <description>Reset is not a result of ipp_reset_b pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ipp_reset_b_1</name>
                  <description>Reset is a result of ipp_reset_b pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>lockup_sysresetreq</name>
              <description>Indicates a reset has been caused by CPU lockup or software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register of the Arm core</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lockup_sysresetreq_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lockup_sysresetreq_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>csu_reset_b</name>
              <description>Indicates whether the reset was the result of the csu_reset_b input.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>csu_reset_b_0</name>
                  <description>Reset is not a result of the csu_reset_b event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>csu_reset_b_1</name>
                  <description>Reset is a result of the csu_reset_b event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ipp_user_reset_b</name>
              <description>Indicates whether the reset was the result of the ipp_user_reset_b qualified reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ipp_user_reset_b_0</name>
                  <description>Reset is not a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ipp_user_reset_b_1</name>
                  <description>Reset is a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>wdog_rst_b</name>
              <description>IC Watchdog Time-out reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdog_rst_b_0</name>
                  <description>Reset is not a result of the watchdog time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdog_rst_b_1</name>
                  <description>Reset is a result of the watchdog time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>jtag_rst_b</name>
              <description>HIGH - Z JTAG reset. Indicates whether the reset was the result of HIGH-Z reset from JTAG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>jtag_rst_b_0</name>
                  <description>Reset is not a result of HIGH-Z reset from JTAG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jtag_rst_b_1</name>
                  <description>Reset is a result of HIGH-Z reset from JTAG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>jtag_sw_rst</name>
              <description>JTAG software reset. Indicates whether the reset was the result of software reset from JTAG.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>jtag_sw_rst_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jtag_sw_rst_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>wdog3_rst_b</name>
              <description>IC Watchdog3 Time-out reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdog3_rst_b_0</name>
                  <description>Reset is not a result of the watchdog3 time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdog3_rst_b_1</name>
                  <description>Reset is a result of the watchdog3 time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>tempsense_rst_b</name>
              <description>Temper Sensor software reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tempsense_rst_b_0</name>
                  <description>Reset is not a result of software reset from Temperature Sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tempsense_rst_b_1</name>
                  <description>Reset is a result of software reset from Temperature Sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBMR2</name>
          <description>SRC Boot Mode Register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CONFIG</name>
              <description>SECONFIG[1] shows the state of the SECONFIG[1] fuse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_FUSE_SEL</name>
              <description>BT_FUSE_SEL (connected to gpio bt_fuse_sel) shows the state of the BT_FUSE_SEL fuse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BMOD</name>
              <description>BMOD[1:0] shows the latched state of the BOOT_MODE1 and BOOT_MODE0 signals on the rising edge of POR_B</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR1</name>
          <description>SRC General Purpose Register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERSISTENT_ENTRY0</name>
              <description>Holds entry function for core0 for waking-up from low power mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR2</name>
          <description>SRC General Purpose Register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERSISTENT_ARG0</name>
              <description>Holds argument of entry function for core0 for waking-up from low power mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR3</name>
          <description>SRC General Purpose Register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR4</name>
          <description>SRC General Purpose Register 4</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR5</name>
          <description>SRC General Purpose Register 5</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR6</name>
          <description>SRC General Purpose Register 6</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR7</name>
          <description>SRC General Purpose Register 7</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR8</name>
          <description>SRC General Purpose Register 8</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR9</name>
          <description>SRC General Purpose Register 9</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR10</name>
          <description>SRC General Purpose Register 10</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERSIST_REDUNDANT_BOOT</name>
              <description>This field identifies which image must be used - 0/1/2/3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSIST_SECONDARY_BOOT</name>
              <description>This bit identifies which image must be used - primary and secondary</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
